content/emacs/modes/use-package-manual.org
# -*- coding:utf-8-*-
#+TITLE: use-package manual
#+AUTHOR: liushangliang
#+EMAIL: phenix3443+github@gmail.com


* 概览
  通过 [[https://github.com/jwiegley/use-package][use-package]] ，可以使 =.emacs= 中的 package 配置更加独立，既不影响性能，又整洁好看。

  use-package 主要通过关键字（keyword）来配置 package，这些关键字涉及 package 的安装、初始化（initialize）、配置（config）、键绑定（key-binding）、自动加载（autoload）等。后面逐步介绍这些关键字。

* 基本使用
  下面是最简单的 use-package 声明：

  #+BEGIN_SRC emacs-lisp
(use-package foo)
  #+END_SRC

  这会加载 foo package，但只有系统存在该 package 时才会加载成功。如果无该 package， =*Message*= buffer 会出现警告信息。

** 加载前准备
   =:init= 关键字设置 package 加载前执行的代码，可用来设置影响 package 加载过程的变量。 即使配置的 package 不存在， =:init= 部分的代码也会执行，所以该部分代码应该保证 package 不存在也可以执行成功。

** 加载后配置
   =:config= 关键字设置 package 加载后执行的代码，主要用来对 package 进行配置。在 package 自动加载（autoload）的情况下，这些代码直到加载时才会执行。

** 自动加载命令（autoload）
   =:command= 关键字会为命令创建自动加载（autoload），他的参数是 symbol 或 symbol 列表。

** 钩子（hook）
   =:hook= 关键字允许将函数添加到钩子上，这里只需要钩子的基本名称。因此，以下所有内容都是等同的：
   #+BEGIN_SRC elisp
(use-package ace-jump-mode
  :hook prog-mode)   ;然而经过测试这种写法并没有生效

(use-package ace-jump-mode
  :hook (prog-mode . ace-jump-mode))

(use-package ace-jump-mode
  :commands ace-jump-mode
  :init
  (add-hook 'prog-mode-hook #'ace-jump-mode))
   #+END_SRC

   同样，如果命令添加到多个钩子，以下内容也是等同的：
   #+BEGIN_SRC elisp
(use-package ace-jump-mode
  :hook (prog-mode text-mode)) ;没有生效

(use-package ace-jump-mode
  :hook ((prog-mode text-mode) . ace-jump-mode))

(use-package ace-jump-mode
  :hook ((prog-mode . ace-jump-mode)
         (text-mode . ace-jump-mode)))

(use-package ace-jump-mode
  :commands ace-jump-mode
  :init
  (add-hook 'prog-mode-hook #'ace-jump-mode)
  (add-hook 'text-mode-hook #'ace-jump-mode))
   #+END_SRC

** 键绑定
   =:bind= 关键字用来设置键绑定：

   #+BEGIN_SRC elisp
(use-package ace-jump-mode
  :bind ("C-." . ace-jump-mode))
   #+END_SRC

   这会做两件事情：
   + 首先,为 ace-jump-mode 命令创建自动加载。
   + 其次，将 ~C-.~ 绑定到该命令。加载之后，可以使用 =M-x describe-personal-keybindings= 查看.emacs 文件中设置的所有键绑定。

   =:bind= 作用基本等同于以下代码：
   #+BEGIN_SRC elisp
(use-package ace-jump-mode
  :commands ace-jump-mode
  :init
  (bind-key "C-." 'ace-jump-mode))
   #+END_SRC

   此外， =:bind= 的配置可以是 cons 或 cons 的列表：

   #+BEGIN_SRC elisp
(use-package hi-lock
  :bind (("M-o l" . highlight-lines-matching-regexp)
         ("M-o r" . highlight-regexp)
         ("M-o w" . highlight-phrase)))
   #+END_SRC

   注意：像 tab 或 F1-Fn 这样的特殊键要可以写在方括号中，如 [tab] 而不是"tab"。键绑定的语法与“kbd”类似：参见[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-Rebinding.html][Init-Rebinding]]

   #+BEGIN_SRC elisp
(use-package helm
  :bind (("M-x" . helm-M-x)
         ("M-<f5>" . helm-find-files)
         ([f10] . helm-buffers-list)
         ([S-f10] . helm-recentf)))
   #+END_SRC

** 禁用模块
   ~:disabled~ 关键字可以关闭遇到困难的模块，或停止加载目前未使用的某个模块：

   #+BEGIN_SRC elisp
(use-package ess-site
  :disabled t
  :commands R)
   #+END_SRC

   字节编译.emacs 文件时，输出的字节码文件中会删除所有禁用的声明，以加快启动速度。

* 基本用法示例
  #+BEGIN_SRC elisp
(use-package color-moccur
  :commands (isearch-moccur isearch-all)
  :bind (("M-s O" . moccur)
         :map isearch-mode-map
         ("M-o" . isearch-moccur)
         ("M-O" . isearch-moccur-all))
  :init
  (setq isearch-lazy-highlight t)
  :config
  (use-package moccur-edit))
  #+END_SRC

  本例中，来自 color-moccur.el 的 isearch-moccur 和 isearch-all 会延迟加载（autoload），并在全局和 isearch-mode-map 中进行了键绑定。当该 package 真正加载时（通过使用其中一个命令），moccur-edit 也会加载，以允许编辑 moccur buffer。

* 高级用法

