emacs/modes/use-package-manual.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-26 日 10:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>use-package manual</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="liushangliang" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="https://phenix3443.github.io/"> HOME </a>
</div><div id="content">
<h1 class="title">use-package manual</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf071d1c">1. 概览</a></li>
<li><a href="#org394b6cf">2. 基本使用</a>
<ul>
<li><a href="#org2b8768b">2.1. 加载前准备</a></li>
<li><a href="#org9e3dff2">2.2. 加载后配置</a></li>
<li><a href="#org022e6da">2.3. 自动加载命令（autoload）</a></li>
<li><a href="#org917a115">2.4. 钩子（hook）</a></li>
<li><a href="#org2c85c55">2.5. 键绑定</a></li>
<li><a href="#org35b362f">2.6. 禁用模块</a></li>
</ul>
</li>
<li><a href="#org9e4f6aa">3. 基本用法示例</a></li>
<li><a href="#org94405f2">4. 高级用法</a>
<ul>
<li><a href="#orgbc8f41c">4.1. 扩展加载路径</a></li>
<li><a href="#orgc5eb192">4.2. 自动安装</a></li>
<li><a href="#orga40eccf">4.3. 绑定 keymap</a></li>
<li><a href="#org5a71b7d">4.4. 局部键绑定</a></li>
<li><a href="#org56ad371">4.5. 模式和解释器</a></li>
<li><a href="#org6443957">4.6. Magic handlers</a></li>
<li><a href="#orgc3d60bc">4.7. custom</a></li>
<li><a href="#orgcef620a">4.8. custom-face</a></li>
<li><a href="#org67098a6">4.9. 延迟加载</a>
<ul>
<li><a href="#org8446b7f">4.9.1. 延迟加载的注意事项</a></li>
</ul>
</li>
<li><a href="#orge144bff">4.10. 条件加载</a>
<ul>
<li><a href="#org6846937">4.10.1. if</a></li>
<li><a href="#orgcb8713e">4.10.2. after</a></li>
<li><a href="#org368f2ac">4.10.3. require</a></li>
</ul>
</li>
<li><a href="#org476199d">4.11. 字节编译配置文件</a></li>
<li><a href="#org8fdeb06">4.12. 编译时阻止加载包</a></li>
<li><a href="#org60c6aa1">4.13. diminish 和 delight 辅助模式</a></li>
</ul>
</li>
<li><a href="#org5301149">5. 加载信息</a></li>
<li><a href="#orge256c12">6. 关键字扩展</a>
<ul>
<li><a href="#org8ea8372">6.1. 如何创建扩展</a>
<ul>
<li><a href="#org69e7e08">6.1.1. First step: Add the keyword</a></li>
<li><a href="#org3a8eb35">6.1.2. Second step: Create a normalizer</a></li>
<li><a href="#orge1f4f36">6.1.3. Third step: Create a handler</a></li>
<li><a href="#org4012eda">6.1.4. Fourth step: Test it out</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgf071d1c" class="outline-2">
<h2 id="orgf071d1c"><span class="section-number-2">1</span> 概览</h2>
<div class="outline-text-2" id="text-1">
<p>
通过 <a href="https://github.com/jwiegley/use-package">use-package</a> ，可以使 <code>.emacs</code> 中的 package 配置更加独立，既不影响性能，又整洁好看。
</p>

<p>
use-package 主要通过关键字（keyword）来配置 package，这些关键字涉及 package 的安装、初始化（initialize）、配置（config）、键绑定（key-binding）、自动加载（autoload）等。后面逐步介绍这些关键字。
</p>
</div>
</div>

<div id="outline-container-org394b6cf" class="outline-2">
<h2 id="org394b6cf"><span class="section-number-2">2</span> 基本使用</h2>
<div class="outline-text-2" id="text-2">
<p>
下面是最简单的 use-package 声明：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">foo</span>)
</pre>
</div>

<p>
这会加载 foo package，但只有系统存在该 package 时才会加载成功。如果无该 package， <code>*Message*</code> buffer 会出现警告信息。
</p>
</div>

<div id="outline-container-org2b8768b" class="outline-3">
<h3 id="org2b8768b"><span class="section-number-3">2.1</span> 加载前准备</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>:init</code> 关键字设置 package 加载前执行的代码，可用来设置影响 package 加载过程的变量。 即使配置的 package 不存在， <code>:init</code> 部分的代码也会执行，所以该部分代码应该保证 package 不存在也可以执行成功。
</p>
</div>
</div>

<div id="outline-container-org9e3dff2" class="outline-3">
<h3 id="org9e3dff2"><span class="section-number-3">2.2</span> 加载后配置</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>:config</code> 关键字设置 package 加载后执行的代码，主要用来对 package 进行配置。在 package 自动加载（autoload）的情况下，这些代码直到加载时才会执行。
</p>
</div>
</div>

<div id="outline-container-org022e6da" class="outline-3">
<h3 id="org022e6da"><span class="section-number-3">2.3</span> 自动加载命令（autoload）</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>:command</code> 关键字会为命令创建自动加载（autoload），他的参数是 symbol 或 symbol 列表。
</p>
</div>
</div>

<div id="outline-container-org917a115" class="outline-3">
<h3 id="org917a115"><span class="section-number-3">2.4</span> 钩子（hook）</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>:hook</code> 关键字允许将函数添加到钩子上，这里只需要钩子的基本名称。因此，以下所有内容都是等同的：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:hook</span> prog-mode)   <span style="color: #6c6c6c; font-style: italic;">;</span><span style="color: #6c6c6c; font-style: italic;">&#28982;&#32780;&#32463;&#36807;&#27979;&#35797;&#36825;&#31181;&#20889;&#27861;&#24182;&#27809;&#26377;&#29983;&#25928;</span>

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:hook</span> (prog-mode . ace-jump-mode))

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:commands</span> ace-jump-mode
  <span style="color: #d18aff;">:init</span>
  (add-hook 'prog-mode-hook #'ace-jump-mode))
</pre>
</div>

<p>
同样，如果命令添加到多个钩子，以下内容也是等同的：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:hook</span> (prog-mode text-mode)) <span style="color: #6c6c6c; font-style: italic;">;</span><span style="color: #6c6c6c; font-style: italic;">&#27809;&#26377;&#29983;&#25928;</span>

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:hook</span> ((prog-mode text-mode) . ace-jump-mode))

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:hook</span> ((prog-mode . ace-jump-mode)
         (text-mode . ace-jump-mode)))

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:commands</span> ace-jump-mode
  <span style="color: #d18aff;">:init</span>
  (add-hook 'prog-mode-hook #'ace-jump-mode)
  (add-hook 'text-mode-hook #'ace-jump-mode))
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c85c55" class="outline-3">
<h3 id="org2c85c55"><span class="section-number-3">2.5</span> 键绑定</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>:bind</code> 关键字用来设置键绑定：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:bind</span> (<span style="color: #ff4ea3;">"C-."</span> . ace-jump-mode))
</pre>
</div>

<p>
这会做两件事情：
</p>
<ul class="org-ul">
<li>首先,为 ace-jump-mode 命令创建自动加载。</li>
<li>其次，将 <code>C-.</code> 绑定到该命令。加载之后，可以使用 <code>M-x describe-personal-keybindings</code> 查看.emacs 文件中设置的所有键绑定。</li>
</ul>

<p>
<code>:bind</code> 作用基本等同于以下代码：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:commands</span> ace-jump-mode
  <span style="color: #d18aff;">:init</span>
  (<span style="color: #a1db00;">bind-key</span> <span style="color: #ff4ea3;">"C-."</span> 'ace-jump-mode))
</pre>
</div>

<p>
此外， <code>:bind</code> 的配置可以是 cons 或 cons 的列表：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">hi-lock</span>
  <span style="color: #d18aff;">:bind</span> ((<span style="color: #ff4ea3;">"M-o l"</span> . highlight-lines-matching-regexp)
         (<span style="color: #ff4ea3;">"M-o r"</span> . highlight-regexp)
         (<span style="color: #ff4ea3;">"M-o w"</span> . highlight-phrase)))
</pre>
</div>

<p>
注意：像 tab 或 F1-Fn 这样的特殊键要可以写在方括号中，如 [tab] 而不是"tab"。键绑定的语法与“kbd”类似：参见<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Init-Rebinding.html">Init-Rebinding</a>
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">helm</span>
  <span style="color: #d18aff;">:bind</span> ((<span style="color: #ff4ea3;">"M-x"</span> . helm-M-x)
         (<span style="color: #ff4ea3;">"M-&lt;f5&gt;"</span> . helm-find-files)
         ([f10] . helm-buffers-list)
         ([S-f10] . helm-recentf)))
</pre>
</div>
</div>
</div>

<div id="outline-container-org35b362f" class="outline-3">
<h3 id="org35b362f"><span class="section-number-3">2.6</span> 禁用模块</h3>
<div class="outline-text-3" id="text-2-6">
<p>
<code>:disabled</code> 关键字可以关闭遇到困难的模块，或停止加载目前未使用的某个模块：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ess-site</span>
  <span style="color: #d18aff;">:disabled</span> t
  <span style="color: #d18aff;">:commands</span> R)
</pre>
</div>

<p>
字节编译.emacs 文件时，输出的字节码文件中会删除所有禁用的声明，以加快启动速度。
</p>
</div>
</div>
</div>

<div id="outline-container-org9e4f6aa" class="outline-2">
<h2 id="org9e4f6aa"><span class="section-number-2">3</span> 基本用法示例</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">color-moccur</span>
  <span style="color: #d18aff;">:commands</span> (isearch-moccur isearch-all)
  <span style="color: #d18aff;">:bind</span> ((<span style="color: #ff4ea3;">"M-s O"</span> . moccur)
         <span style="color: #d18aff;">:map</span> isearch-mode-map
         (<span style="color: #ff4ea3;">"M-o"</span> . isearch-moccur)
         (<span style="color: #ff4ea3;">"M-O"</span> . isearch-moccur-all))
  <span style="color: #d18aff;">:init</span>
  (<span style="color: #a1db00;">setq</span> isearch-lazy-highlight t)
  <span style="color: #d18aff;">:config</span>
  (<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">moccur-edit</span>))
</pre>
</div>

<p>
本例中，来自 color-moccur.el 的 isearch-moccur 和 isearch-all 会延迟加载（autoload），并在全局和 isearch-mode-map 中进行了键绑定。当该 package 真正加载时（通过使用其中一个命令），moccur-edit 也会加载，以允许编辑 moccur buffer。
</p>
</div>
</div>
