content/emacs/modes/use-package-manual.org
** 扩展加载路径
   如果 pacakge 的加载需要将一个目录添加到 load-path 中，使用 ~:load-path~ 。参数可以是一个符号、函数、字符串或字符串列表。如果是相对路径，基于 user-emacs-directory 进行扩展。

   #+BEGIN_SRC emacs-lisp
(use-package ess-site
  :load-path "site-lisp/ess/lisp/"
  :commands R)
   #+END_SRC

   注意，如果使用一个符号或函数来动态生成路径列表，必须通知字节编译器该定义，以保证该值在编译时可用。这通过使用特殊形式（special form）eval-and-compile (而不是 eval-when-compile)实现。进一步说，该值固定为编译期间确定的值，避免在每次启动时再次查找相同的信息：

   #+BEGIN_SRC emacs-lisp
(eval-and-compile
  (defun ess-site-load-path ()
    (shell-command "find ~ -path ess/lisp")))

(use-package ess-site
  :load-path (lambda () (list (ess-site-load-path)))
  :commands R)
   #+END_SRC

** 自动安装
   可以使用 use-package 配合 package.el 从 ELPA 加载 pacakge。这对于在多个机器之间共享.emacs 很有用；在.emacs 中声明的 package 都会自动下载。 ~:ensure~ 关键字会自动安装系统没有的 package。

   #+BEGIN_SRC emacs-lisp
(use-package magit
  :ensure t)
   #+END_SRC

   如果希望所有包 package 都这样处理，需要设置

   #+BEGIN_SRC
(setq use-package-always-ensure t)
   #+END_SRC

   可以这样指定 安装 package 的别名：

   #+BEGIN_SRC emacs-lisp
(use-package tex-site
  :ensure auctex)
   #+END_SRC

   注意： =:ensure= 会安装系统上没有的 package，但不会进行主动更新。如果希望主动更新，可以使用 auto-package-update，如
   #+BEGIN_SRC elisp
(use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t)
  (setq auto-package-update-hide-results t)
  (auto-package-update-maybe))
   #+END_SRC

   最后，如果 Emacs 是 24.4 或更高版本，use-package 可以将一个包 pin 到特定的 archive，允许混合和匹配来自不同 archive 的 package。主要使用场景是从 gnu 和 melpa-stable 选择 package（混合选择）；但需要跟踪稳定 archive 可用新版本时，使用 melpa 指定的 pacakge 也是一个有效的使用场景。

   默认情况下，由于版本比较（> evil-20141208.623 evil-1.0.9），package.el 更喜欢 melpa 而不是 melpa-stable，所以即使只跟踪 melpa 中的一个包，也需要用适当的 archive 标记所有非 melpa 的 pakage。 如果觉得麻烦，那么可以通过 =use-package-always-pin= 来设置默认值。

   如果想手动保持更新 package 并忽略上游更新，可以将其 pin 到 =manual= ，只要没有该名称的 respository 就可以正常工作。

   如果尝试将 package pin 到一个没有使用 package-archives 配置的 archive（除了上面提到的 manual archive），use-package 将会引发错误：

   #+BEGIN_EXAMPLE
   Archive 'foo' requested for package 'bar' is not available.
   #+END_EXAMPLE

   Example:

   #+BEGIN_SRC elisp
(use-package company
  :ensure t
  :pin melpa-stable)

(use-package evil
  :ensure t)
  ;; no :pin needed, as package.el will choose the version in melpa

(use-package adaptive-wrap
  :ensure t
  ;; as this package is available only in the gnu archive, this is
  ;; technically not needed, but it helps to highlight where it
  ;; comes from
  :pin gnu)

(use-package org
  :ensure t
  ;; ignore org-mode from upstream and use a manually installed version
  :pin manual)
   #+END_SRC

   注意：pin 参数对于版本小于 24.4 的 emacs 无效。

   其他的 package 管理器通过重写 use-package-ensure-function 或 use-package-pre-ensure-function，可以覆盖 =:ensure= ，进而使用自身而不是 package.el。目前，唯一这么做的是 =straight.el=。

** 绑定 keymap
   通常 ~:bind~ 绑定的命令是 package 中自动加载的函数。然而，如果命令实际上是键映射（keymap）的话，这就有所不同了，因为键映射不是函数，不能使用 Emacs 的自动加载机制进行自动加载。

   为了处理这种情况，use-package 提供了 ~:bind-keymap~ ，它是 ~:bind~ 一个特殊受限的变体。 二者之间的唯一区别是： ~:bind-keymap~ 绑定的命令必须是 package 中定义的键映射，而不是命令函数。这通过生成一段定制代码来处理：这段代码首先加载含有键映射的 package，加载之后再次执行后续的按键，也就说，将 =:bind-keymap= 绑定的按键解释为一个前缀键来处理。
   #+BEGIN_SRC elisp
(use-package projectile
  :bind-keymap
  ("C-c p" . projectile-command-map))
   #+END_SRC
   =C-h c C-c p= 可以查看到 =C-c p= 绑定到了 lambda 函数。

  备注：但是实践的过程中，发现这个关键字使用还有一些注意事项：
  + 和 guide-key 有点冲突，参见 https://github.com/jwiegley/use-package/issues/685
  + 这个指令不能和 hook，或者 global-mode 一起使用，如果这样使用， =bind= 中绑定的按键就会在当前 mode 中变成全局按键。换个角度，既然已经是 global 了，为什么还要把这些按键绑定到 local-mole-map 呢？

  具体用法示例如下：
  #+BEGIN_SRC elisp
(use-package smartparens-config
  :ensure smartparens
  :bind-keymap ("C-c s" . smartparens-mode-map)
  :bind
  (:map smartparens-mode-map
        ("c" . sp-beginning-of-next-sexp))
  )
  #+END_SRC
  等同于
  #+BEGIN_SRC elisp
(use-package smartparens-config
  :ensure smartparens
  :bind
  (:prefix-map smartparens-mode-map
               :prefix "C-c s"
               ("c" . sp-beginning-of-next-sexp))
  )
  #+END_SRC


** 局部键绑定
   与绑定到键映射稍微不同，局部 keymap 的键绑定只有在 package 加载后才生效。use-package 通过 ~:map~ 修饰符支持局部键绑定：

   #+BEGIN_SRC emacs-lisp
(use-package helm
  :bind (:map helm-mode-map
         ("C-c h" . helm-execute-persistent-action)))
   #+END_SRC

   上面声明等到 helm 加载后才生效，在 helm 的局部键映射 helm-mode-map 中将 =C-c h= 绑定到 helm-execute-persistent-action。

   可以使用多个 ~:map~ 。首次使用 ~:map~ 之前的任何绑定都应用于全局键映射。

   #+BEGIN_SRC emacs-lisp
(use-package term
  :bind (("C-c t" . term)
         :map term-mode-map
         ("M-p" . term-send-up)
         ("M-n" . term-send-down)
         :map term-raw-map
         ("M-o" . other-window)
         ("M-p" . term-send-up)
         ("M-n" . term-send-down)))
   #+END_SRC


** 模式和解释器
   类似 ~:bind~ ,可以使用 ~:mode~ 和 ~:interpreter~ 在变量 auto-mode-alist 和 interpreter-mode-alist 中建立延迟绑定。这些关键字的参数可以是 cons、 列表、字符串或正则表达式。

   #+BEGIN_SRC emacs-lisp
(use-package ruby-mode
  :mode "\\.rb\\'"
  :interpreter "ruby")

;; The package is "python" but the mode is "python-mode":
(use-package python
  :mode ("\\.py\\'" . python-mode)
  :interpreter ("python" . python-mode))
   #+END_SRC

