emacs/modes/use-package-manual.html

<div id="outline-container-org94405f2" class="outline-2">
<h2 id="org94405f2"><span class="section-number-2">4</span> 高级用法</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgbc8f41c" class="outline-3">
<h3 id="orgbc8f41c"><span class="section-number-3">4.1</span> 扩展加载路径</h3>
<div class="outline-text-3" id="text-4-1">
<p>
如果 pacakge 的加载需要将一个目录添加到 load-path 中，使用 <code>:load-path</code> 。参数可以是一个符号、函数、字符串或字符串列表。如果是相对路径，基于 user-emacs-directory 进行扩展。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ess-site</span>
  <span style="color: #d18aff;">:load-path</span> <span style="color: #ff4ea3;">"site-lisp/ess/lisp/"</span>
  <span style="color: #d18aff;">:commands</span> R)
</pre>
</div>

<p>
注意，如果使用一个符号或函数来动态生成路径列表，必须通知字节编译器该定义，以保证该值在编译时可用。这通过使用特殊形式（special form）eval-and-compile (而不是 eval-when-compile)实现。进一步说，该值固定为编译期间确定的值，避免在每次启动时再次查找相同的信息：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">eval-and-compile</span>
  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">ess-site-load-path</span> ()
    (shell-command <span style="color: #ff4ea3;">"find ~ -path ess/lisp"</span>)))

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ess-site</span>
  <span style="color: #d18aff;">:load-path</span> (<span style="color: #a1db00;">lambda</span> () (list (ess-site-load-path)))
  <span style="color: #d18aff;">:commands</span> R)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5eb192" class="outline-3">
<h3 id="orgc5eb192"><span class="section-number-3">4.2</span> 自动安装</h3>
<div class="outline-text-3" id="text-4-2">
<p>
可以使用 use-package 配合 package.el 从 ELPA 加载 pacakge。这对于在多个机器之间共享.emacs 很有用；在.emacs 中声明的 package 都会自动下载。 <code>:ensure</code> 关键字会自动安装系统没有的 package。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">magit</span>
  <span style="color: #d18aff;">:ensure</span> t)
</pre>
</div>

<p>
如果希望所有包 package 都这样处理，需要设置
</p>

<pre class="example">
(setq use-package-always-ensure t)
</pre>

<p>
可以这样指定 安装 package 的别名：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">tex-site</span>
  <span style="color: #d18aff;">:ensure</span> auctex)
</pre>
</div>

<p>
注意： <code>:ensure</code> 会安装系统上没有的 package，但不会进行主动更新。如果希望主动更新，可以使用 auto-package-update，如
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">auto-package-update</span>
  <span style="color: #d18aff;">:config</span>
  (<span style="color: #a1db00;">setq</span> auto-package-update-delete-old-versions t)
  (<span style="color: #a1db00;">setq</span> auto-package-update-hide-results t)
  (auto-package-update-maybe))
</pre>
</div>

<p>
最后，如果 Emacs 是 24.4 或更高版本，use-package 可以将一个包 pin 到特定的 archive，允许混合和匹配来自不同 archive 的 package。主要使用场景是从 gnu 和 melpa-stable 选择 package（混合选择）；但需要跟踪稳定 archive 可用新版本时，使用 melpa 指定的 pacakge 也是一个有效的使用场景。
</p>

<p>
默认情况下，由于版本比较（&gt; evil-20141208.623 evil-1.0.9），package.el 更喜欢 melpa 而不是 melpa-stable，所以即使只跟踪 melpa 中的一个包，也需要用适当的 archive 标记所有非 melpa 的 pakage。 如果觉得麻烦，那么可以通过 <code>use-package-always-pin</code> 来设置默认值。
</p>

<p>
如果想手动保持更新 package 并忽略上游更新，可以将其 pin 到 <code>manual</code> ，只要没有该名称的 respository 就可以正常工作。
</p>

<p>
如果尝试将 package pin 到一个没有使用 package-archives 配置的 archive（除了上面提到的 manual archive），use-package 将会引发错误：
</p>

<pre class="example">
   Archive 'foo' requested for package 'bar' is not available.
</pre>

<p>
Example:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">company</span>
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #d18aff;">:pin</span> melpa-stable)

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">evil</span>
  <span style="color: #d18aff;">:ensure</span> t)
  <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">no :pin needed, as package.el will choose the version in melpa</span>

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">adaptive-wrap</span>
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">as this package is available only in the gnu archive, this is</span>
  <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">technically not needed, but it helps to highlight where it</span>
  <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">comes from</span>
  <span style="color: #d18aff;">:pin</span> gnu)

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">org</span>
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">ignore org-mode from upstream and use a manually installed version</span>
  <span style="color: #d18aff;">:pin</span> manual)
</pre>
</div>

<p>
注意：pin 参数对于版本小于 24.4 的 emacs 无效。
</p>

<p>
其他的 package 管理器通过重写 use-package-ensure-function 或 use-package-pre-ensure-function，可以覆盖 <code>:ensure</code> ，进而使用自身而不是 package.el。目前，唯一这么做的是 =straight.el=。
</p>
</div>
</div>

<div id="outline-container-orga40eccf" class="outline-3">
<h3 id="orga40eccf"><span class="section-number-3">4.3</span> 绑定 keymap</h3>
<div class="outline-text-3" id="text-4-3">
<p>
通常 <code>:bind</code> 绑定的命令是 package 中自动加载的函数。然而，如果命令实际上是键映射（keymap）的话，这就有所不同了，因为键映射不是函数，不能使用 Emacs 的自动加载机制进行自动加载。
</p>

<p>
为了处理这种情况，use-package 提供了 <code>:bind-keymap</code> ，它是 <code>:bind</code> 一个特殊受限的变体。 二者之间的唯一区别是： <code>:bind-keymap</code> 绑定的命令必须是 package 中定义的键映射，而不是命令函数。这通过生成一段定制代码来处理：这段代码首先加载含有键映射的 package，加载之后再次执行后续的按键，也就说，将 <code>:bind-keymap</code> 绑定的按键解释为一个前缀键来处理。
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">projectile</span>
  <span style="color: #d18aff;">:bind-keymap</span>
  (<span style="color: #ff4ea3;">"C-c p"</span> . projectile-command-map))
</pre>
</div>
<p>
<code>C-h c C-c p</code> 可以查看到 <code>C-c p</code> 绑定到了 lambda 函数。
</p>

<p>
备注：但是实践的过程中，发现这个关键字使用还有一些注意事项：
</p>
<ul class="org-ul">
<li>和 guide-key 有点冲突，参见 <a href="https://github.com/jwiegley/use-package/issues/685">https://github.com/jwiegley/use-package/issues/685</a></li>
<li>这个指令不能和 hook，或者 global-mode 一起使用，如果这样使用， <code>bind</code> 中绑定的按键就会在当前 mode 中变成全局按键。换个角度，既然已经是 global 了，为什么还要把这些按键绑定到 local-mole-map 呢？</li>
</ul>

<p>
具体用法示例如下：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">smartparens-config</span>
  <span style="color: #d18aff;">:ensure</span> smartparens
  <span style="color: #d18aff;">:bind-keymap</span> (<span style="color: #ff4ea3;">"C-c s"</span> . smartparens-mode-map)
  <span style="color: #d18aff;">:bind</span>
  (<span style="color: #d18aff;">:map</span> smartparens-mode-map
        (<span style="color: #ff4ea3;">"c"</span> . sp-beginning-of-next-sexp))
  )
</pre>
</div>
<p>
等同于
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">smartparens-config</span>
  <span style="color: #d18aff;">:ensure</span> smartparens
  <span style="color: #d18aff;">:bind</span>
  (<span style="color: #d18aff;">:prefix-map</span> smartparens-mode-map
               <span style="color: #d18aff;">:prefix</span> <span style="color: #ff4ea3;">"C-c s"</span>
               (<span style="color: #ff4ea3;">"c"</span> . sp-beginning-of-next-sexp))
  )
</pre>
</div>
</div>
</div>


<div id="outline-container-org5a71b7d" class="outline-3">
<h3 id="org5a71b7d"><span class="section-number-3">4.4</span> 局部键绑定</h3>
<div class="outline-text-3" id="text-4-4">
<p>
与绑定到键映射稍微不同，局部 keymap 的键绑定只有在 package 加载后才生效。use-package 通过 <code>:map</code> 修饰符支持局部键绑定：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">helm</span>
  <span style="color: #d18aff;">:bind</span> (<span style="color: #d18aff;">:map</span> helm-mode-map
         (<span style="color: #ff4ea3;">"C-c h"</span> . helm-execute-persistent-action)))
</pre>
</div>

<p>
上面声明等到 helm 加载后才生效，在 helm 的局部键映射 helm-mode-map 中将 <code>C-c h</code> 绑定到 helm-execute-persistent-action。
</p>

<p>
可以使用多个 <code>:map</code> 。首次使用 <code>:map</code> 之前的任何绑定都应用于全局键映射。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">term</span>
  <span style="color: #d18aff;">:bind</span> ((<span style="color: #ff4ea3;">"C-c t"</span> . term)
         <span style="color: #d18aff;">:map</span> term-mode-map
         (<span style="color: #ff4ea3;">"M-p"</span> . term-send-up)
         (<span style="color: #ff4ea3;">"M-n"</span> . term-send-down)
         <span style="color: #d18aff;">:map</span> term-raw-map
         (<span style="color: #ff4ea3;">"M-o"</span> . other-window)
         (<span style="color: #ff4ea3;">"M-p"</span> . term-send-up)
         (<span style="color: #ff4ea3;">"M-n"</span> . term-send-down)))
</pre>
</div>
</div>
</div>


<div id="outline-container-org56ad371" class="outline-3">
<h3 id="org56ad371"><span class="section-number-3">4.5</span> 模式和解释器</h3>
<div class="outline-text-3" id="text-4-5">
<p>
类似 <code>:bind</code> ,可以使用 <code>:mode</code> 和 <code>:interpreter</code> 在变量 auto-mode-alist 和 interpreter-mode-alist 中建立延迟绑定。这些关键字的参数可以是 cons、 列表、字符串或正则表达式。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ruby-mode</span>
  <span style="color: #d18aff;">:mode</span> <span style="color: #ff4ea3;">"\\.rb\\'"</span>
  <span style="color: #d18aff;">:interpreter</span> <span style="color: #ff4ea3;">"ruby"</span>)

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">The package is "python" but the mode is "python-mode":</span>
(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">python</span>
  <span style="color: #d18aff;">:mode</span> (<span style="color: #ff4ea3;">"\\.py\\'"</span> . python-mode)
  <span style="color: #d18aff;">:interpreter</span> (<span style="color: #ff4ea3;">"python"</span> . python-mode))
</pre>
</div>
</div>
</div>
