content/emacs/modes/use-package-manual.org
** Magic handlers
   类似于 =:mode= 和 =:interpreter= ，如果文件开始处符合给定的正则表达式，您还可以使用 =:magic= 和 =:magic-fallback= 执行函数。两者之间的区别在于 =:magic-fallback= 的优先级低于 =:mode= 。例如：
   #+BEGIN_SRC elisp
(use-package pdf-tools
  :load-path "site-lisp/pdf-tools/lisp"
  :magic ("%PDF" . pdf-view-mode)
  :config
  (pdf-tools-install))
   #+END_SRC

** custom
   =:custom= 关键字允许设置 package 的自定义变量。
   #+BEGIN_SRC elisp
(use-package comint
  :custom
  (comint-buffer-maximum-size 20000 "Increase comint buffer size.")
  (comint-prompt-read-only t "Make the prompt read only."))
   #+END_SRC
   文档字符串并不是必须的。

   这些仅适用那些希望通过 customization 定制 use-package 中声明的变量的人。从功能上来说，与 =:config= 中使用 setq 相比，唯一的好处在于，设置当被赋值时可能会执行代码。如果当前使用 =M-x customize-option= 保存设置文件，不会想用该选项。

** custom-face
   =:custom-face= 用来设置 package 自定义 face。
   #+BEGIN_SRC elisp
(use-package eruby-mode
  :custom-face
  (eruby-standard-face ((t (:slant italic)))))
   #+END_SRC

** 延迟加载
   如果没有使用 ~:commands, :bind, :bind*, :bind-keymap, :bind-keymap*, :mode, or :interpreter~ （这些都意味着 ~:defer~ ; 参阅 use-package 中的文档对每个都简单了解一下），也可以使用 ~:defer~ 关键字实现延迟加载：
   #+BEGIN_SRC emacs-lisp
(use-package ace-jump-mode
  :defer t
  :init
  (autoload 'ace-jump-mode "ace-jump-mode" nil t)
  (bind-key "C-." 'ace-jump-mode))
   #+END_SRC

   这等同于：

   #+BEGIN_SRC emacs-lisp
(use-package ace-jump-mode
  :bind ("C-." . ace-jump-mode))
   #+END_SRC

*** 延迟加载的注意事项

    几乎所有情况下都不需要手动指定 ~:defer t~ 。每当使用 ~:bind~ 、 ~:mode、 ~:interpreter~ 时，这都是隐含的。 通常，如果知道其他 package 会做一些事情导致当前 package 在适当的时间加载，只需指定 ~:defer~, 因而即使 use-package 不会为你创建任何自动加载，也会推迟加载。

    可以使用 ~:demand~ 关键字覆盖包的延迟加载。因此，即使使用 ~:bind~ ，使用 ~:demand~ 也会强制立即加载，不会为绑定键建立任何自动加载。

** 条件加载

*** if
    可以使用 =:if= 关键字来预测模块的加载和初始化。 例如，只想让 edit-server 运行在图形 Emacs 下，而不是其他从命令行启动的 Emacsen：

    #+BEGIN_SRC emacs-lisp
(use-package edit-server
  :if window-system
  :init
  (add-hook 'after-init-hook 'server-start t)
  (add-hook 'after-init-hook 'edit-server-start t))
    #+END_SRC

    此外，还可以限制操作系统：
    #+BEGIN_SRC elisp
(use-package exec-path-from-shell
  :if (memq window-system '(mac ns))
  :ensure t
  :config
  (exec-path-from-shell-initialize))
    #+END_SRC

*** after
    有时，只有在另一个 package 加载之后，加载当前 package 才有意义，因为有些变量或函数此前不在作用域内。这可以通过 =:after= 关键字来实现，该关键字允许设置相当丰富的加载条件。这里有一个例子：
    #+BEGIN_SRC elisp
(use-package hydra
  :load-path "site-lisp/hydra")

(use-package ivy
  :load-path "site-lisp/swiper")

(use-package ivy-hydra
  :after (ivy hydra))
    #+END_SRC

    这种情况下，所有的 package 都按照它们出现的顺序进行了加载，使用 =:after= 关键字不是绝对必要的。但是，通过使用它，上面的代码可以变得与顺序无关，init 文件本质上隐含了这种顺序依赖关系。

    默认情况下, =:after(foo bar)= 与 =:after(:all foo bar)= 相同，这意味着直到 foo 和 bar 加载后才会加载该 package。以下是其他一些可能的例子：

    #+BEGIN_SRC elisp
:after (foo bar)
:after (:all foo bar)
:after (:any foo bar)
:after (:all (:any foo bar) (:any baz quux))
:after (:any (:all foo bar) (:all baz quux))
    #+END_SRC

    当嵌套使用选择器时，例如 =(:any (:all foo bar) (:all baz quux))= ， 这意味着只要 foo 和 bar 其中之一加载，或者 baz 和 quux 必须都加载，package 才会加载，。

    注意：如果 use-package-always-defer 设置为 t，并且使用了 =:after= 关键字，则需要说明声明 package 的加载方式：例如通过 =:bind= 。如果没有使用注册自动加载的机制，例如 =:bind= 或 =:hook= ，包管理器也没有提供自动加载，如果不给这些声明添加 =:demand= 的话，package 将永远不会加载。

*** require
    虽然 =:after= 可以让 package 在依赖加载后才加载，但如果依赖不可用时， =:require= 关键字更简单些，它不会加载该 package。此时的可用是指 =(featurep 'foo)= 计算 non-nil，例如：
    #+BEGIN_SRC elisp
(use-package abbrev
  :requires foo)
    #+END_SRC

    等同于

    #+BEGIN_SRC elisp
(use-package abbrev
  :if (featurep 'foo))
    #+END_SRC

    更方便是可以指定一个 package 列表：

    #+BEGIN_SRC elisp
(use-package abbrev
  :requires (foo bar baz))
    #+END_SRC
    更复杂的逻辑，比如 =:after= 支持的那些，只需使用 =:if= 和适合的 lisp 表达式就可以实现。


** 字节编译配置文件
   use-package 另一个特点，字节编译了.emacs 文件后，它总是加载所有文件。这有助于消除未知变量和函数引起的虚假警告。

   然而，有时这还不够。这时，使用 ~:defines~ 和 ~:functions~ 关键字只为字节编译器引入虚拟变量和函数声明。

   #+BEGIN_SRC emacs-lisp
(use-package texinfo
  :defines texinfo-section-list
  :commands texinfo-mode
  :init
  (add-to-list 'auto-mode-alist '("\\.texi$" . texinfo-mode)))
   #+END_SRC

   如果需要消除一个缺失函数的警告，可以使用 ~:function~ :

   #+BEGIN_SRC emacs-lisp
(use-package ruby-mode
  :mode "\\.rb\\'"
  :interpreter "ruby"
  :functions inf-ruby-keys
  :config
  (defun my-ruby-mode-hook ()
    (require 'inf-ruby)
    (inf-ruby-keys))

  (add-hook 'ruby-mode-hook 'my-ruby-mode-hook))
   #+END_SRC

** 编译时阻止加载包
   正常情况下，编译时，use-package 在编译配置之前加载 package，以满足字节编译器所需的任何必要的符号都在作用域中。有时这会导致问题，因为 package 可能有特殊加载要求，为此希望 use-package 可以为 eval-after-load hook 添加一个配置。这种情况下，使用 ~:no-require~ 关键字。（没有理解啥意思和具体是使用场景，不使用不就是这样么）

   #+BEGIN_SRC emacs-lisp
(use-package foo
  :no-require t
  :config
  (message "This is evaluated when `foo' is loaded"))
   #+END_SRC

