emacs/modes/use-package-manual.html

<div id="outline-container-org6443957" class="outline-3">
<h3 id="org6443957"><span class="section-number-3">4.6</span> Magic handlers</h3>
<div class="outline-text-3" id="text-4-6">
<p>
类似于 <code>:mode</code> 和 <code>:interpreter</code> ，如果文件开始处符合给定的正则表达式，您还可以使用 <code>:magic</code> 和 <code>:magic-fallback</code> 执行函数。两者之间的区别在于 <code>:magic-fallback</code> 的优先级低于 <code>:mode</code> 。例如：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">pdf-tools</span>
  <span style="color: #d18aff;">:load-path</span> <span style="color: #ff4ea3;">"site-lisp/pdf-tools/lisp"</span>
  <span style="color: #d18aff;">:magic</span> (<span style="color: #ff4ea3;">"%PDF"</span> . pdf-view-mode)
  <span style="color: #d18aff;">:config</span>
  (pdf-tools-install))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc3d60bc" class="outline-3">
<h3 id="orgc3d60bc"><span class="section-number-3">4.7</span> custom</h3>
<div class="outline-text-3" id="text-4-7">
<p>
<code>:custom</code> 关键字允许设置 package 的自定义变量。
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">comint</span>
  <span style="color: #d18aff;">:custom</span>
  (comint-buffer-maximum-size 20000 <span style="color: #ff4ea3;">"Increase comint buffer size."</span>)
  (comint-prompt-read-only t <span style="color: #ff4ea3;">"Make the prompt read only."</span>))
</pre>
</div>
<p>
文档字符串并不是必须的。
</p>

<p>
这些仅适用那些希望通过 customization 定制 use-package 中声明的变量的人。从功能上来说，与 <code>:config</code> 中使用 setq 相比，唯一的好处在于，设置当被赋值时可能会执行代码。如果当前使用 <code>M-x customize-option</code> 保存设置文件，不会想用该选项。
</p>
</div>
</div>

<div id="outline-container-orgcef620a" class="outline-3">
<h3 id="orgcef620a"><span class="section-number-3">4.8</span> custom-face</h3>
<div class="outline-text-3" id="text-4-8">
<p>
<code>:custom-face</code> 用来设置 package 自定义 face。
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">eruby-mode</span>
  <span style="color: #d18aff;">:custom-face</span>
  (eruby-standard-face ((t (<span style="color: #d18aff;">:slant</span> italic)))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org67098a6" class="outline-3">
<h3 id="org67098a6"><span class="section-number-3">4.9</span> 延迟加载</h3>
<div class="outline-text-3" id="text-4-9">
<p>
如果没有使用 <code>:commands, :bind, :bind*, :bind-keymap, :bind-keymap*, :mode, or :interpreter</code> （这些都意味着 <code>:defer</code> ; 参阅 use-package 中的文档对每个都简单了解一下），也可以使用 <code>:defer</code> 关键字实现延迟加载：
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:defer</span> t
  <span style="color: #d18aff;">:init</span>
  (autoload 'ace-jump-mode <span style="color: #ff4ea3;">"ace-jump-mode"</span> nil t)
  (<span style="color: #a1db00;">bind-key</span> <span style="color: #ff4ea3;">"C-."</span> 'ace-jump-mode))
</pre>
</div>

<p>
这等同于：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:bind</span> (<span style="color: #ff4ea3;">"C-."</span> . ace-jump-mode))
</pre>
</div>
</div>

<div id="outline-container-org8446b7f" class="outline-4">
<h4 id="org8446b7f"><span class="section-number-4">4.9.1</span> 延迟加载的注意事项</h4>
<div class="outline-text-4" id="text-4-9-1">
<p>
几乎所有情况下都不需要手动指定 <code>:defer t</code> 。每当使用 <code>:bind</code> 、 <code>:mode、 ~:interpreter</code> 时，这都是隐含的。 通常，如果知道其他 package 会做一些事情导致当前 package 在适当的时间加载，只需指定 <code>:defer</code>, 因而即使 use-package 不会为你创建任何自动加载，也会推迟加载。
</p>

<p>
可以使用 <code>:demand</code> 关键字覆盖包的延迟加载。因此，即使使用 <code>:bind</code> ，使用 <code>:demand</code> 也会强制立即加载，不会为绑定键建立任何自动加载。
</p>
</div>
</div>
</div>

<div id="outline-container-orge144bff" class="outline-3">
<h3 id="orge144bff"><span class="section-number-3">4.10</span> 条件加载</h3>
<div class="outline-text-3" id="text-4-10">
</div>
<div id="outline-container-org6846937" class="outline-4">
<h4 id="org6846937"><span class="section-number-4">4.10.1</span> if</h4>
<div class="outline-text-4" id="text-4-10-1">
<p>
可以使用 <code>:if</code> 关键字来预测模块的加载和初始化。 例如，只想让 edit-server 运行在图形 Emacs 下，而不是其他从命令行启动的 Emacsen：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">edit-server</span>
  <span style="color: #d18aff;">:if</span> window-system
  <span style="color: #d18aff;">:init</span>
  (add-hook 'after-init-hook 'server-start t)
  (add-hook 'after-init-hook 'edit-server-start t))
</pre>
</div>

<p>
此外，还可以限制操作系统：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">exec-path-from-shell</span>
  <span style="color: #d18aff;">:if</span> (memq window-system '(mac ns))
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #d18aff;">:config</span>
  (exec-path-from-shell-initialize))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcb8713e" class="outline-4">
<h4 id="orgcb8713e"><span class="section-number-4">4.10.2</span> after</h4>
<div class="outline-text-4" id="text-4-10-2">
<p>
有时，只有在另一个 package 加载之后，加载当前 package 才有意义，因为有些变量或函数此前不在作用域内。这可以通过 <code>:after</code> 关键字来实现，该关键字允许设置相当丰富的加载条件。这里有一个例子：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">hydra</span>
  <span style="color: #d18aff;">:load-path</span> <span style="color: #ff4ea3;">"site-lisp/hydra"</span>)

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ivy</span>
  <span style="color: #d18aff;">:load-path</span> <span style="color: #ff4ea3;">"site-lisp/swiper"</span>)

(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ivy-hydra</span>
  <span style="color: #d18aff;">:after</span> (ivy hydra))
</pre>
</div>

<p>
这种情况下，所有的 package 都按照它们出现的顺序进行了加载，使用 <code>:after</code> 关键字不是绝对必要的。但是，通过使用它，上面的代码可以变得与顺序无关，init 文件本质上隐含了这种顺序依赖关系。
</p>

<p>
默认情况下, <code>:after(foo bar)</code> 与 <code>:after(:all foo bar)</code> 相同，这意味着直到 foo 和 bar 加载后才会加载该 package。以下是其他一些可能的例子：
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #d18aff;">:after</span> (foo bar)
<span style="color: #d18aff;">:after</span> (<span style="color: #d18aff;">:all</span> foo bar)
<span style="color: #d18aff;">:after</span> (<span style="color: #d18aff;">:any</span> foo bar)
<span style="color: #d18aff;">:after</span> (<span style="color: #d18aff;">:all</span> (<span style="color: #d18aff;">:any</span> foo bar) (<span style="color: #d18aff;">:any</span> baz quux))
<span style="color: #d18aff;">:after</span> (<span style="color: #d18aff;">:any</span> (<span style="color: #d18aff;">:all</span> foo bar) (<span style="color: #d18aff;">:all</span> baz quux))
</pre>
</div>

<p>
当嵌套使用选择器时，例如 <code>(:any (:all foo bar) (:all baz quux))</code> ， 这意味着只要 foo 和 bar 其中之一加载，或者 baz 和 quux 必须都加载，package 才会加载，。
</p>

<p>
注意：如果 use-package-always-defer 设置为 t，并且使用了 <code>:after</code> 关键字，则需要说明声明 package 的加载方式：例如通过 <code>:bind</code> 。如果没有使用注册自动加载的机制，例如 <code>:bind</code> 或 <code>:hook</code> ，包管理器也没有提供自动加载，如果不给这些声明添加 <code>:demand</code> 的话，package 将永远不会加载。
</p>
</div>
</div>

<div id="outline-container-org368f2ac" class="outline-4">
<h4 id="org368f2ac"><span class="section-number-4">4.10.3</span> require</h4>
<div class="outline-text-4" id="text-4-10-3">
<p>
虽然 <code>:after</code> 可以让 package 在依赖加载后才加载，但如果依赖不可用时， <code>:require</code> 关键字更简单些，它不会加载该 package。此时的可用是指 <code>(featurep 'foo)</code> 计算 non-nil，例如：
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">abbrev</span>
  <span style="color: #d18aff;">:requires</span> foo)
</pre>
</div>

<p>
等同于
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">abbrev</span>
  <span style="color: #d18aff;">:if</span> (<span style="color: #a1db00;">featurep</span> '<span style="color: #5fafd7;">foo</span>))
</pre>
</div>

<p>
更方便是可以指定一个 package 列表：
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">abbrev</span>
  <span style="color: #d18aff;">:requires</span> (foo bar baz))
</pre>
</div>
<p>
更复杂的逻辑，比如 <code>:after</code> 支持的那些，只需使用 <code>:if</code> 和适合的 lisp 表达式就可以实现。
</p>
</div>
</div>
</div>


<div id="outline-container-org476199d" class="outline-3">
<h3 id="org476199d"><span class="section-number-3">4.11</span> 字节编译配置文件</h3>
<div class="outline-text-3" id="text-4-11">
<p>
use-package 另一个特点，字节编译了.emacs 文件后，它总是加载所有文件。这有助于消除未知变量和函数引起的虚假警告。
</p>

<p>
然而，有时这还不够。这时，使用 <code>:defines</code> 和 <code>:functions</code> 关键字只为字节编译器引入虚拟变量和函数声明。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">texinfo</span>
  <span style="color: #d18aff;">:defines</span> texinfo-section-list
  <span style="color: #d18aff;">:commands</span> texinfo-mode
  <span style="color: #d18aff;">:init</span>
  (add-to-list 'auto-mode-alist '(<span style="color: #ff4ea3;">"\\.texi$"</span> . texinfo-mode)))
</pre>
</div>

<p>
如果需要消除一个缺失函数的警告，可以使用 <code>:function</code> :
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ruby-mode</span>
  <span style="color: #d18aff;">:mode</span> <span style="color: #ff4ea3;">"\\.rb\\'"</span>
  <span style="color: #d18aff;">:interpreter</span> <span style="color: #ff4ea3;">"ruby"</span>
  <span style="color: #d18aff;">:functions</span> inf-ruby-keys
  <span style="color: #d18aff;">:config</span>
  (<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">my-ruby-mode-hook</span> ()
    (<span style="color: #a1db00;">require</span> '<span style="color: #5fafd7;">inf-ruby</span>)
    (inf-ruby-keys))

  (add-hook 'ruby-mode-hook 'my-ruby-mode-hook))
</pre>
</div>
</div>
</div>

<div id="outline-container-org8fdeb06" class="outline-3">
<h3 id="org8fdeb06"><span class="section-number-3">4.12</span> 编译时阻止加载包</h3>
<div class="outline-text-3" id="text-4-12">
<p>
正常情况下，编译时，use-package 在编译配置之前加载 package，以满足字节编译器所需的任何必要的符号都在作用域中。有时这会导致问题，因为 package 可能有特殊加载要求，为此希望 use-package 可以为 eval-after-load hook 添加一个配置。这种情况下，使用 <code>:no-require</code> 关键字。（没有理解啥意思和具体是使用场景，不使用不就是这样么）
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">foo</span>
  <span style="color: #d18aff;">:no-require</span> t
  <span style="color: #d18aff;">:config</span>
  (message <span style="color: #ff4ea3;">"This is evaluated when `</span><span style="color: #5fafd7;">foo</span><span style="color: #ff4ea3;">' is loaded"</span>))
</pre>
</div>
</div>
</div>
