content/emacs/modes/use-package-manual.org
** diminish 和 delight 辅助模式
   如果安装 diminsh 和 delight，use-package 内置对它们的支持。它的目的是删除或更改 mode line 中的字符串。

   通过 ~:diminish~ 关键字调用 diminish，该关键字需要一个 minor mode symbol 或符号组成的 cons 以及替代字符串；也可以仅是替代符串，这种情况下，通过末尾带有“-mode"的 package 名猜 minor modes symbol。

   #+BEGIN_SRC emacs-lisp
(use-package abbrev
  :diminish abbrev-mode
  :config
  (if (file-exists-p abbrev-file-name)
      (quietly-read-abbrev-file)))
   #+END_SRC

   通过 =:delight= 关键字调用 delight，该关键字需要 minor mode symbol 和替换字符串，或带引号的 mode-line 数据（这种情况下，通过末尾带有“-mode"的 package 名猜 minor modes symbol）。这两种用法，或两种用法组成的 list，都可以作为关键字的参数。如果没有提供参数，默认该模式名字完全隐藏。

   #+BEGIN_SRC elisp
;; Don't show anything for rainbow-mode.
(use-package rainbow-mode
  :delight)

;; Don't show anything for auto-revert-mode, which doesn't match
;; its package name.
(use-package autorevert
  :delight auto-revert-mode)

;; Remove the mode name for projectile-mode, but show the project name.
(use-package projectile
  :delight '(:eval (concat " " (projectile-project-name))))

;; Completely hide visual-line-mode and change auto-fill-mode to " AF".
(use-package emacs
  :delight
  (auto-fill-function " AF")
  (visual-line-mode))
   #+END_SRC
* 加载信息
  package 加载时，如果 use-package-verbose 设置为 t，或者包加载耗时超过 0.1s，就会在 ~*Messages* buffer~ 中看到指示此加载活动。如果 ~:config~ 块执行超过 0.1s 配置也同样处理。通常，应该保持 ~:init~ 应该尽可能简单和迅速，尽可能放在 ~:config~ 块中。这样，延迟加载可以帮助 Emacs 尽快启动。

  此外，如果初始化或配置 package 时发生了错误，不会阻止 Emacs 继续加载。相反，use-package 会捕获到该错误，并在 ~*Warnings* popup buffer~ 中报告，这样可以在其他功能正常的 Emacs 中进行调试。

  如果想查看已加载的软件包数量，它们已达到的初始化阶段以及它们花费的总时间（大致），则可以在加载 use-pacakge 后，任何使用 use-package 之前启用 use-package-compute-statistics-package，然后运行命令 Mx use-package-report 查看结果。 显示的缓冲区是一个列表，可以在列中使用 S 进行排序。

* 关键字扩展
  Starting with version 2.0, use-package is based on an extensible framework that makes it easy for package authors to add new keywords, or modify the behavior of existing keywords.

  Some keyword extensions are now included in the use-package distribution and can be optionally installed.

  #+BEGIN_SRC elisp
(use-package-ensure-system-package)
  #+END_SRC

  The :ensure-system-package keyword allows you to ensure system binaries exist alongside your package declarations.

  First, you will want to make sure exec-path is cognisant of all binary package names that you would like to ensure are installed. exec-path-from-shell is often a good way to do this.

  To enable the extension after you've loaded use-package:

  #+BEGIN_SRC elisp
(use-package use-package-ensure-system-package
  :ensure t)
  #+END_SRC

  Here’s an example of usage:
  #+BEGIN_SRC elisp
(use-package rg
  :ensure-system-package rg)
  #+END_SRC

  This will expect a global binary package to exist called rg. If it does not, it will use your system package manager (using the package system-packages) to attempt an install of a binary by the same name asyncronously. For example, for most macOS users this would call: brew install rg.

  If the package is named differently than the binary, you can use a cons in the form of (binary . package-name), i.e.:
  #+BEGIN_SRC elisp
(use-package rg
  :ensure-system-package
  (rg . ripgrep))
  #+END_SRC

  In the previous macOS example, this would call: brew install ripgrep if rg was not found.

  What if you want to customize the install command further?
  #+BEGIN_SRC elisp
(use-package tern
  :ensure-system-package (tern . "npm i -g tern"))
  #+END_SRC

  :ensure-system-package can also take a cons where its cdr is a string that will get called by (async-shell-command) to install if it isn’t found.

  You may also pass in a list of cons-es:
  #+BEGIN_SRC
(use-package ruby-mode
  :ensure-system-package
  ((rubocop     . "gem install rubocop")
   (ruby-lint   . "gem install ruby-lint")
   (ripper-tags . "gem install ripper-tags")
   (pry         . "gem install pry")))
(use-package-chords)
  #+END_SRC
  The :chords keyword allows you to define key-chord bindings for use-package declarations in the same manner as the :bind keyword.

  To enable the extension:
  #+BEGIN_SRC elisp
(use-package use-package-chords
  :ensure t
  :config (key-chord-mode 1))
  #+END_SRC

  Then you can define your chord bindings in the same manner as :bind using a cons or a list of conses:

  #+BEGIN_SRC elisp
(use-package ace-jump-mode
  :chords (("jj" . ace-jump-char-mode)
           ("jk" . ace-jump-word-mode)
           ("jl" . ace-jump-line-mode)))
  #+END_SRC


** 如何创建扩展

*** First step: Add the keyword

    The first step is to add your keyword at the right place in use-package-keywords. This list determines the order in which things will happen in the expanded code. You should never change this order, but it gives you a framework within which to decide when your keyword should fire.

*** Second step: Create a normalizer

    Define a normalizer for your keyword by defining a function named after the keyword, for example:

    #+BEGIN_SRC emacs-lisp
(defun use-package-normalize/:pin (name-symbol keyword args)
  (use-package-only-one (symbol-name keyword) args
    (lambda (label arg)
      (cond
       ((stringp arg) arg)
       ((symbolp arg) (symbol-name arg))
       (t
        (use-package-error
         ":pin wants an archive name (a string)"))))))
    #+END_SRC


    The job of the normalizer is take a list of arguments (possibly nil), and turn it into the single argument (which could still be a list) that should appear in the final property list used by use-package.

