emacs/modes/use-package-manual.html

<div id="outline-container-org60c6aa1" class="outline-3">
<h3 id="org60c6aa1"><span class="section-number-3">4.13</span> diminish 和 delight 辅助模式</h3>
<div class="outline-text-3" id="text-4-13">
<p>
如果安装 diminsh 和 delight，use-package 内置对它们的支持。它的目的是删除或更改 mode line 中的字符串。
</p>

<p>
通过 <code>:diminish</code> 关键字调用 diminish，该关键字需要一个 minor mode symbol 或符号组成的 cons 以及替代字符串；也可以仅是替代符串，这种情况下，通过末尾带有“-mode"的 package 名猜 minor modes symbol。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">abbrev</span>
  <span style="color: #d18aff;">:diminish</span> abbrev-mode
  <span style="color: #d18aff;">:config</span>
  (<span style="color: #a1db00;">if</span> (file-exists-p abbrev-file-name)
      (quietly-read-abbrev-file)))
</pre>
</div>

<p>
通过 <code>:delight</code> 关键字调用 delight，该关键字需要 minor mode symbol 和替换字符串，或带引号的 mode-line 数据（这种情况下，通过末尾带有“-mode"的 package 名猜 minor modes symbol）。这两种用法，或两种用法组成的 list，都可以作为关键字的参数。如果没有提供参数，默认该模式名字完全隐藏。
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Don't show anything for rainbow-mode.</span>
(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">rainbow-mode</span>
  <span style="color: #d18aff;">:delight</span>)

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Don't show anything for auto-revert-mode, which doesn't match</span>
<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">its package name.</span>
(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">autorevert</span>
  <span style="color: #d18aff;">:delight</span> auto-revert-mode)

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Remove the mode name for projectile-mode, but show the project name.</span>
(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">projectile</span>
  <span style="color: #d18aff;">:delight</span> '(<span style="color: #d18aff;">:eval</span> (concat <span style="color: #ff4ea3;">" "</span> (projectile-project-name))))

<span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">Completely hide visual-line-mode and change auto-fill-mode to " AF".</span>
(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">emacs</span>
  <span style="color: #d18aff;">:delight</span>
  (auto-fill-function <span style="color: #ff4ea3;">" AF"</span>)
  (visual-line-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5301149" class="outline-2">
<h2 id="org5301149"><span class="section-number-2">5</span> 加载信息</h2>
<div class="outline-text-2" id="text-5">
<p>
package 加载时，如果 use-package-verbose 设置为 t，或者包加载耗时超过 0.1s，就会在 <code>*Messages* buffer</code> 中看到指示此加载活动。如果 <code>:config</code> 块执行超过 0.1s 配置也同样处理。通常，应该保持 <code>:init</code> 应该尽可能简单和迅速，尽可能放在 <code>:config</code> 块中。这样，延迟加载可以帮助 Emacs 尽快启动。
</p>

<p>
此外，如果初始化或配置 package 时发生了错误，不会阻止 Emacs 继续加载。相反，use-package 会捕获到该错误，并在 <code>*Warnings* popup buffer</code> 中报告，这样可以在其他功能正常的 Emacs 中进行调试。
</p>

<p>
如果想查看已加载的软件包数量，它们已达到的初始化阶段以及它们花费的总时间（大致），则可以在加载 use-pacakge 后，任何使用 use-package 之前启用 use-package-compute-statistics-package，然后运行命令 Mx use-package-report 查看结果。 显示的缓冲区是一个列表，可以在列中使用 S 进行排序。
</p>
</div>
</div>

<div id="outline-container-orge256c12" class="outline-2">
<h2 id="orge256c12"><span class="section-number-2">6</span> 关键字扩展</h2>
<div class="outline-text-2" id="text-6">
<p>
Starting with version 2.0, use-package is based on an extensible framework that makes it easy for package authors to add new keywords, or modify the behavior of existing keywords.
</p>

<p>
Some keyword extensions are now included in the use-package distribution and can be optionally installed.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(use-package-ensure-system-package)
</pre>
</div>

<p>
The :ensure-system-package keyword allows you to ensure system binaries exist alongside your package declarations.
</p>

<p>
First, you will want to make sure exec-path is cognisant of all binary package names that you would like to ensure are installed. exec-path-from-shell is often a good way to do this.
</p>

<p>
To enable the extension after you've loaded use-package:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">use-package-ensure-system-package</span>
  <span style="color: #d18aff;">:ensure</span> t)
</pre>
</div>

<p>
Here’s an example of usage:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">rg</span>
  <span style="color: #d18aff;">:ensure-system-package</span> rg)
</pre>
</div>

<p>
This will expect a global binary package to exist called rg. If it does not, it will use your system package manager (using the package system-packages) to attempt an install of a binary by the same name asyncronously. For example, for most macOS users this would call: brew install rg.
</p>

<p>
If the package is named differently than the binary, you can use a cons in the form of (binary . package-name), i.e.:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">rg</span>
  <span style="color: #d18aff;">:ensure-system-package</span>
  (rg . ripgrep))
</pre>
</div>

<p>
In the previous macOS example, this would call: brew install ripgrep if rg was not found.
</p>

<p>
What if you want to customize the install command further?
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">tern</span>
  <span style="color: #d18aff;">:ensure-system-package</span> (tern . <span style="color: #ff4ea3;">"npm i -g tern"</span>))
</pre>
</div>

<p>
:ensure-system-package can also take a cons where its cdr is a string that will get called by (async-shell-command) to install if it isn’t found.
</p>

<p>
You may also pass in a list of cons-es:
</p>
<pre class="example">
(use-package ruby-mode
  :ensure-system-package
  ((rubocop     . "gem install rubocop")
   (ruby-lint   . "gem install ruby-lint")
   (ripper-tags . "gem install ripper-tags")
   (pry         . "gem install pry")))
(use-package-chords)
</pre>
<p>
The :chords keyword allows you to define key-chord bindings for use-package declarations in the same manner as the :bind keyword.
</p>

<p>
To enable the extension:
</p>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">use-package-chords</span>
  <span style="color: #d18aff;">:ensure</span> t
  <span style="color: #d18aff;">:config</span> (key-chord-mode 1))
</pre>
</div>

<p>
Then you can define your chord bindings in the same manner as :bind using a cons or a list of conses:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="color: #a1db00;">use-package</span> <span style="color: #5fafd7;">ace-jump-mode</span>
  <span style="color: #d18aff;">:chords</span> ((<span style="color: #ff4ea3;">"jj"</span> . ace-jump-char-mode)
           (<span style="color: #ff4ea3;">"jk"</span> . ace-jump-word-mode)
           (<span style="color: #ff4ea3;">"jl"</span> . ace-jump-line-mode)))
</pre>
</div>
</div>


<div id="outline-container-org8ea8372" class="outline-3">
<h3 id="org8ea8372"><span class="section-number-3">6.1</span> 如何创建扩展</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org69e7e08" class="outline-4">
<h4 id="org69e7e08"><span class="section-number-4">6.1.1</span> First step: Add the keyword</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
The first step is to add your keyword at the right place in use-package-keywords. This list determines the order in which things will happen in the expanded code. You should never change this order, but it gives you a framework within which to decide when your keyword should fire.
</p>
</div>
</div>

<div id="outline-container-org3a8eb35" class="outline-4">
<h4 id="org3a8eb35"><span class="section-number-4">6.1.2</span> Second step: Create a normalizer</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
Define a normalizer for your keyword by defining a function named after the keyword, for example:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">use-package-normalize/:pin</span> (name-symbol keyword args)
  (use-package-only-one (symbol-name keyword) args
    (<span style="color: #a1db00;">lambda</span> (label arg)
      (<span style="color: #a1db00;">cond</span>
       ((stringp arg) arg)
       ((symbolp arg) (symbol-name arg))
       (t
        (use-package-error
         <span style="color: #ff4ea3;">":pin wants an archive name (a string)"</span>))))))
</pre>
</div>


<p>
The job of the normalizer is take a list of arguments (possibly nil), and turn it into the single argument (which could still be a list) that should appear in the final property list used by use-package.
</p>
</div>
</div>
