emacs/modes/use-package-manual.html

<div id="outline-container-orge1f4f36" class="outline-4">
<h4 id="orge1f4f36"><span class="section-number-4">6.1.3</span> Third step: Create a handler</h4>
<div class="outline-text-4" id="text-6-1-3">
<p>
Once you have a normalizer, you must create a handler for the keyword:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #a1db00;">defun</span> <span style="color: #ffd700;">use-package-handler/:pin</span> (name-symbol keyword archive-name rest state)
  (<span style="color: #a1db00;">let</span> ((body (use-package-process-keywords name-symbol rest state)))
    <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">This happens at macro expansion time, not when the expanded code is</span>
    <span style="color: #6c6c6c; font-style: italic;">;; </span><span style="color: #6c6c6c; font-style: italic;">compiled or evaluated.</span>
    (<span style="color: #a1db00;">if</span> (null archive-name)
        body
      (use-package-pin-package name-symbol archive-name)
      (use-package-concat
       body
       `((<span style="color: #a1db00;">push</span> '(,name-symbol . ,archive-name)
               package-pinned-packages))))))
</pre>
</div>

<p>
Handlers can affect the handling of keywords in two ways. First, it can modify the state plist before recursively processing the remaining keywords, to influence keywords that pay attention to the state (one example is the state keyword :deferred, not to be confused with the use-package keyword :defer). Then, once the remaining keywords have been handled and their resulting forms returned, the handler may manipulate, extend, or just ignore those forms.
</p>

<p>
The task of each handler is to return a list of forms representing code to be inserted. It does not need to be a progn list, as this is handled automatically in other places. Thus it is very common to see the idiom of using use-package-concat to add new functionality before or after a code body, so that only the minimum code necessary is emitted as the result of a use-package expansion.
</p>
</div>
</div>

<div id="outline-container-org4012eda" class="outline-4">
<h4 id="org4012eda"><span class="section-number-4">6.1.4</span> Fourth step: Test it out</h4>
<div class="outline-text-4" id="text-6-1-4">
<p>
After the keyword has been inserted into use-package-keywords, and a normalizer and a handler defined, you can now test it by seeing how usages of the keyword will expand. For this, temporarily set use-package-debug to t, and just evaluate the use-package declaration. The expansion will be shown in a special buffer called <b>use-package</b>.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: liushangliang</p>
<p class="email">Email: <a href="mailto:phenix3443+github@gmail.com">phenix3443+github@gmail.com</a></p>
<p class="date">Created: 2020-04-26 日 10:53</p>
<p class="validation"></p>
</div>
</body>
</html>
